Уникальные значения признаков:

- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
- salary: >50K,<=50K

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("C:/Users/vpanshina/adult.data.csv", names=['age', 'workclass', 'fnlwgt', 'education', 'education_num', 
                                                               'marital_status', 'occupation', 'relationship', 'race', 'sex', 
                                                               'capital_gain','capital_loss','hours_per_week','native_country',
                                                               'salary'])
data.head(3)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

#### 1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [3]:
#1var
data.value_counts('sex')

sex
 Male      21790
 Female    10771
dtype: int64

In [4]:
#2var
data.groupby('sex',as_index=False).agg({'salary': 'count'}).rename(columns={'salary':'count'})

       sex  count
0   Female  10771
1     Male  21790

#### 2. Каков средний возраст (признак age) женщин?

In [5]:
data.groupby('sex',as_index=False).agg({'age': 'mean'})

       sex        age
0   Female  36.858230
1     Male  39.433547

#### 3. Какова доля граждан Германии (признак native-country)?

In [6]:
country=data.groupby('native_country',as_index=False).agg({'age': 'count'}).rename(columns={'age':'total'})

In [7]:
country['perc']= (country['total']/country['total'].sum())*100

In [8]:
country['perc']= country['perc'] *100

In [9]:
country.query('native_country == " Germany"')

   native_country  total       perc
11        Germany    137  42.074875

#### 4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

In [10]:
data.salary = data.salary.str.lstrip()

In [11]:
# менее 50K в год
data.query('salary == "<=50K"').describe()
# mean - 36.7 и std - 14

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,24720.000000,2.472000e+04,24720.000000,24720.000000,24720.000000,24720.000000
mean,36.783738,1.903409e+05,9.595065,148.752468,53.142921,38.840210
std,14.020088,1.064823e+05,2.436147,963.139307,310.755769,12.318995
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,25.000000,1.176060e+05,9.000000,0.000000,0.000000,35.000000
50%,34.000000,1.794650e+05,9.000000,0.000000,0.000000,40.000000
75%,46.000000,2.390230e+05,10.000000,0.000000,0.000000,40.000000
max,90.000000,1.484705e+06,16.000000,41310.000000,4356.000000,99.000000

In [12]:
# более 50K в год
data.query('salary == ">50K"').describe()
# mean - 44.2 и std - 10.5

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,7841.000000,7.841000e+03,7841.000000,7841.000000,7841.000000,7841.000000
mean,44.249841,1.880050e+05,11.611657,4006.142456,195.001530,45.473026
std,10.519028,1.025418e+05,2.385129,14570.378951,595.487574,11.012971
min,19.000000,1.487800e+04,2.000000,0.000000,0.000000,1.000000
25%,36.000000,1.191010e+05,10.000000,0.000000,0.000000,40.000000
50%,44.000000,1.761010e+05,12.000000,0.000000,0.000000,40.000000
75%,51.000000,2.309590e+05,13.000000,0.000000,0.000000,50.000000
max,90.000000,1.226583e+06,16.000000,99999.000000,3683.000000,99.000000

#### 6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [13]:
data.education = data.education.str.lstrip()

In [14]:
data.query('salary == ">50K"').groupby('education', as_index=False).agg({'age': 'count'}).rename(columns={'age':'total'})
#это ложь. еть и те, кто не получал высшего образования, но зарабатывает больше 50К

       education  total
0           10th     62
1           11th     60
2           12th     33
3        1st-4th      6
4        5th-6th     16
5        7th-8th     40
6            9th     27
7     Assoc-acdm    265
8      Assoc-voc    361
9      Bachelors   2221
10     Doctorate    306
11       HS-grad   1675
12       Masters    959
13   Prof-school    423
14  Some-college   1387

#### 7. Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [15]:
#1var
data.groupby(['race', 'sex'], as_index=False).agg({'age': 'max'}).query('sex == " Male"& race == " Amer-Indian-Eskimo"').describe()

        age
count   1.0
mean   82.0
std     NaN
min    82.0
25%    82.0
50%    82.0
75%    82.0
max    82.0

In [16]:
#2var
data.query('sex == " Male" & race == " Amer-Indian-Eskimo"').describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,192.000000,192.000000,192.000000,192.000000,192.000000,192.000000
mean,37.208333,125715.364583,9.072917,675.260417,46.395833,42.197917
std,12.049563,85063.251595,2.268587,2929.745443,286.562584,11.596280
min,17.000000,13769.000000,2.000000,0.000000,0.000000,3.000000
25%,28.000000,48197.750000,9.000000,0.000000,0.000000,40.000000
50%,35.000000,113091.000000,9.000000,0.000000,0.000000,40.000000
75%,45.000000,182656.000000,10.000000,0.000000,0.000000,45.000000
max,82.000000,356015.000000,16.000000,27828.000000,1980.000000,84.000000

#### 8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.

In [17]:
data.query('salary == ">50K"').groupby('marital_status',as_index=False).agg({'age': 'count'}).rename(columns={'age':'count'})

           marital_status  count
0                Divorced    463
1       Married-AF-spouse     10
2      Married-civ-spouse   6692
3   Married-spouse-absent     34
4           Never-married    491
5               Separated     66
6                 Widowed     85

In [18]:
#married
10+6692+34

6736

In [19]:
#not married
463+491+66+85

1105

#### 9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [20]:
#максимальное число часов
data.hours_per_week.max()

99

In [21]:
#кол-во людей, работающих 99 ч. - 85 чел
hours=data.query('hours_per_week == 99')
hours.shape

(85, 15)

In [22]:
# %  - 29% зарабатывают >50K
rich=hours.groupby('salary',as_index=False).agg({'age': 'count'}).rename(columns={'age':'count'})
rich['perc']= rich['count']/rich['count'].sum()
rich['perc']= rich['perc'] * 100
rich

  salary  count       perc
0  <=50K     60  70.588235
1   >50K     25  29.411765

#### 10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).

In [23]:
data.groupby(['native_country', 'salary'], as_index=False).agg({'hours_per_week': 'mean'}).query('native_country == " Japan"')

   native_country salary  hours_per_week
47          Japan  <=50K       41.000000
48          Japan   >50K       47.958333